# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

print('Введите число')
a=int (input())
b=a
c=a
sum=0
while b>0:
    c=int(b%10)
    sum=sum+c
    b=int(b/10)
print(sum)
