# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no
print('Введите число')
a=int (input())
b=a
c=a
sum=0
i=0
while i<3 :
    c=int(b%10)
    sum=sum+c
    b=int(b/10)
    i=i+1
print(sum)
sum2=0
c=0
i=0
while i<3 :
    c=int(b%10)
    sum2=sum2+c
    b=int(b/10)
    i=i+1
if sum==sum2:
    print("да")
else :
    print("нет")    